[{"lat": 38.103128, "text": "We need people with disposable income to support city and Downtown", "lon": -122.2595}, {"lat": 38.112298, "text": "I grew up and graduated from their (Admiral Farragut Elementary School)", "lon": -122.263198}, {"lat": 38.099276, "text": "(Vallejo's waterfront, especially near the ferry terminal is my most frequent) regular respite after an especially difficult day or just to clear my head! - Johnny Walker", "lon": -122.262125}, {"lat": 38.080919, "text": "(Mare Island Preserve) an incredible gift to citizens of Vallejo and beyond. A place that combines histoy, nature and education with fun events and brethtaking views", "lon": -122.256138}, {"lat": 38.099276, "text": "(Vallejo waterfront) Great place to hangout", "lon": -122.262125}, {"lat": 38.098123, "text": "The view from the waterfront, the potential for growth, great place to eat, meet people and see the better part of Vallejo. Great place to exercise and feel good about life!", "lon": -122.261223}, {"lat": 38.119093, "text": "Amazing walking space: fresh air, meeting other citizens, beautiful!! And it's my backyard too!", "lon": -122.217235}, {"lat": 38.080568, "text": "The sound of fog horns, the sounds of big ships and the train", "lon": -122.214939}, {"lat": 38.1002, "text": "Hello, I grew up in the area, when I went to school I was a tomboy was always climbing on the roof at the school and one day a boy told me how pretty I was, to stop climbing. I no longer climb climb on the school roof. I also wore a dress to school for the first time.", "lon": -122.224381}, {"lat": 38.083498, "text": "I walk here several times a week. The view from this part of Mare Island is one of the view where you can imagine the original bay!", "lon": -122.264861}, {"lat": 38.079868, "text": "(Mare Island Historic Heritage Preserve) A beautiful location with lots of scenery and local history. Myrna Hayes runs the visitors center. She sponsors many events throughout the year.", "lon": -122.255463}, {"lat": 38.129998, "text": "(White Slough) Watching the evolution from 1976 to the present: from dry land, to flooded due to broken levees, to improved roadway and marsh growth so mature that endangered clapper rails can live on the north section of the Bay Trail on the south side provides acess for the kids to see birds and find amphipods and experience the wild right in town. The excitement in thir eyes and voices and the mud on their shoes leads to understanding and stewardship.", "lon": -122.2647}, {"lat": 38.149449, "text": "(1646 Lorenzo Dr) I've lived there all my life and I have many memories there.", "lon": -122.25583}, {"lat": 38.079868, "text": "(Mare Island Nature Preserve)", "lon": -122.255463}, {"lat": 38.136244, "text": "Vallejo has a spur on the Bay Ridge Trail that will ultimately go all around the bay. Unfortuantely, our section is a \"dead end.\" (opportunity??!!??)", "lon": -122.200916}, {"lat": 38.115786, "text": "The Waterfront", "lon": -122.273743}, {"lat": 38.07546, "text": "I love nature", "lon": -122.251427}, {"lat": 38.099037, "text": "Mare Island", "lon": -122.271855}, {"lat": 38.105724, "text": "The downtown FiberOptics", "lon": -122.263186}, {"lat": 38.081262, "text": "(The Preserve at Mare Island) hiking, views of the SF Bay, dog friendly, community, music, nature, history", "lon": -122.256042}, {"lat": 38.115301, "text": "(River Park) trails, views of Mare Island", "lon": -122.27178}, {"lat": 38.10545, "text": "Downtown Vallejo is historic and will get better - it's all about community", "lon": -122.258706}, {"lat": 38.115301, "text": "Love to walk here every evening", "lon": -122.27178}, {"lat": 38.135448, "text": "Solano Community College, Vallejo Campus - School rocks!", "lon": -122.203796}, {"lat": 38.075406, "text": "This place is beautiful and historic and brings together people in a community of birders, walkers, music-lovers, and dog people", "lon": -122.249973}, {"lat": 38.125947, "text": "Grew up here!", "lon": -122.238762}, {"lat": 38.111983, "text": "(Sonoma Blvd @ Illinois Street) Kyle's Temple Community Garden", "lon": -122.25468}, {"lat": 38.13627, "text": "(Solano County Fair) It was so great in the old days when we had a Real County Fair with Horse Racing and Gardens", "lon": -122.227386}, {"lat": 38.067064, "text": "(Sogorea Te, Glen Cove Waterfront) Sogorea Te is a Native American Sacred Burial Site. GVRD desicrated it!! Shame!", "lon": -122.208206}, {"lat": 38.088075, "text": "Cannibus clubs are great becuase it keeps our minds open and refreshed", "lon": -122.243206}]
